package com.andy.moneywizparser.model;

public enum ConsumeType {

    C1("尊親"),
    C2("養小孩"),
    C3("保養"),
    C4("醫療"),
    C5("餐飲/外食"),
    C6("娛樂"),
    C7("日用生活品"),
    C8("其他"),
    C9("聚餐"),
    C10("停車"),
    C11("旅遊"),
    C12("雜貨"),
    C13("交通費"),
    C14("汽油"),
    C15("藥妝"),
    C16("玩具遊戲"),
    C17("慈善捐款"),
    C18("借款代買"),
    C19("送禮請客"),
    C20("3C產品"),
    C21("牙科"),
    C22("抵押"),
    C23("健身/運動"),
    C24("悠遊卡加值"),
    C25("網路寬頻"),
    C26("進修學習"),
    C27("電視節目"),
    C28("個人保養"),
    C29("稅款"),
    C30("電費"),
    C31("保險"),
    C32("自動匯入"),
    C33("應用程式"),
    C34("衣服"),
    C35("鞋"),
    C36("家具/裝飾品"),
    C37("書本"),
    C38("過路費"),
    C39("醫療保險"),
    C40("配件"),
    C41("手機"),
    C43("租金");


    private String name;

    ConsumeType(String name) {
        this.name = name;
    }

    public String getName() {
        return name;
    }
}
